# """
# 1) Есть список:  s = ['a', 'b', 'c', 'd', 'e']
# Необходимо написать программу, которая сдвинет список следующим образом:
# ['c', 'd', 'e', 'a', 'b']
# """
# s = ['a', 'b', 'c', 'd', 'e']
#
# for i in range(2):
#     k = s.pop(0)
#     s.append(k)
# print(s)

# """
# 2) Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.
# *Пример:*
# пусть N = 4, тогда [1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)
# """
# num = int(input('Введите число: '))
# my_list = []
# res = 1
#
# for i in range(num):
#     res *= (i + 1)
#     my_list.append(res)
# print(my_list)

# # 3) Напишите программу, которая найдёт произведение пар чисел списка.
# # Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# #     *Пример:*
# # [2, 3, 4, 5, 6] => [12, 15, 4];
# # [2, 3, 5, 6] => [12, 15]
# my_list = [1, 2, 7, 4, 5, 5, 11, 20, 7]
# new_list = []
#
# for i in range(len(my_list)// 2):
#     new_list.append(my_list[i] * my_list[len(my_list) - 1 - i])
# if len(my_list) % 2 != 0:
#     new_list.append(my_list[len(my_list) // 2])
# print(new_list)


# 4) Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.
# *Пример:*
# для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21]
num = int(input('Введите число: '))
fib = [1, 0, 1]

for _ in range(2, num):
    fib.append(fib[len(fib) - 1] + fib[len(fib) - 2])
    fib.insert(0, fib[1] - fib[0])

print(fib)
